// Да се напише програма, която проверява дали дадена кредитна карта от
// определен тип — VISA или MasterCard, има валиден номер. За валидиране на номера
// на кредитните карти, да се използва следното описание:
// Номерата на кредитните карти са 16-цифрени в групи по четири.
// Например, да проверим дали следната кредитна карта е валидна:
// 4 2 0 4 – 5 8 7 6 – 9 0 1 2 – 5 2 3 4
// 1) Обръщаме цифрите на номера и получаваме:
// 4 3 2 5 2 1 0 9 6 7 8 5 4 0 2 4
// 2) Удвояваме цифрите, стоящи на четна позиция, и получаваме:
// 4 6 2 10 2 2 0 18 6 14 8 10 4 0 2 8
// 3) Ако получим събираеми, по-големи от 9, ги разделяме на две отделни цифри.
// Събираме така получените цифри:
// 4 + 6 + 2 + 1 + 0 + 2 + 2 + 0 + 1 + 8 + 6 + 1 + 4 + 8 + 1 + 0 + 4 + 0 + 2 + 8 = 60
// 4) Ако сборът се дели на 10 без остатък, то кредитната карта е валидна.
// Ако номерът започва с 4, то типът ѝ е VISA, а ако има префикс 51–55, тя е MasterCard.

#include "funcVisa.h"

int main()
{
    int cardNumber[SIZE];
    scanArray(cardNumber);
    printArray(cardNumber);
    int cardType = valid(cardNumber);
    reverse(cardNumber, SIZE);
    doubleEvenPositions(cardNumber, SIZE);
    int sum = totalSum(cardNumber, SIZE);
    printResult(sum, cardType);

    return 0;
}
