// Дадени са два правоъгълника със страни успоредни на координатните оси. Да се намерят: сумата от
// лицата им, лицето на обединението и сечението им.
// Вход. На всеки от редовете на стандартния вход ще бъде зададена по една двойка правоъгълници с осем
// цели неотрицателни числа координати на горния ляв и долния десен ъгъл на единия и другия
// правоъгълник.
// Ограничения. Всички числа са по малки или равни на 100.
// Изход. За всяка двойка правоъгълници, на един ред на стандартния изход програмата трябва да изведе 3
// числа сумата от лицата на двата правоъгълника, лицето на обединението и лицето на сечението им.
// Пример:
// Вход.                  Изход.
// 0 1 1 0 0 2 2 0        5 4 1
// 0 1 1 0 2 1 3 0        2 2 0
// 0 2 3 1 1 3 2 0        6 5 1

#include <math.h>
#include <stdio.h>
#include <stdlib.h>

struct point
{
    int x;
    int y;
};

struct rect
{
    struct point a;
    struct point b;
};

int area(struct point a, struct point b);

int main()
{
    struct point a = {0, 1};
    struct point b = {1, 0};
    struct rect r1 = {a, b};
    struct point c = {0, 2};
    struct point d = {2, 0};
    struct rect r2 = {a, b};
    
    printf("%d\n", area(a, b) + area(c, d));
    
    return 0;
}

int area(struct point a, struct point b)
{
    return (a.x + a.y) * (b.x + b.y);
}
