// Задача 18. Да се напише програма, която намира сумата на всички числа, които се делят на 7 и са в
// интервала между числото a и числото b. Целите числа a и b се задават на вход

#include <stdio.h>

int main () {
	int a = 0, b = 0;
	int sum = 0;

	scanf("%d %d", &a, &b);

	for (size_t i = a; i <= b; i++)
	{
		if (i % 7 == 0)
		{
			sum += i;
		}
	}
	printf("%d\n", sum);

	return 0;
}