// Задача 19. За да стане голям един заек му е необходим един месец. След още един месец се ражда
// още един заeк и така зайците стават 2. След още един месец първият заeк ражда още едно ново
// зайче, а вторият е пораснал и така зайците са станали 3. След още един месец първите два заека
// раждат по още един нов заек, а третият порасва и така нататък.
// По този начин се получава известната редица на Фибоначи от числата 1, 1, 2, 3, 5, 8, 13, . . .
// Характерното за тази редица е, че всяко следващо число от нея се получава като се сумират
// предходните две числа. Да се напише програма, която чете едно цяло положително число n и
// извежда n тото число от тази редица

#include <stdio.h>

// Function to find the nth Fibonacci number
int fib(int n)
{
    if (n <= 1) {
        return n;
    }
 
    return fib(n - 1) + fib(n - 2);
}
 
int main()
{
    int n = 0;
	printf("Enter the index of the element you need: ");
	scanf("%d", &n);
 
    printf("F(n) = %d\n", fib(n));
 
    return 0;
}
